# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

# определение переменной int
some0 = 5

# определение переменной str
some1 = 'five'

# определение переменной float
some2 = 3.14

# определение переменной bool
some3 = False

# вывод на экран определенных переменных
print ('Переменная типа int:', some0)
print ('Переменная типа str:', some1)
print ('Переменная типа float:', some2)
print ('Переменная типа bool:', some3)

# получение переменной пользователя
some10 = input('Введите переменную пользователя:')

# вывод на экран переменной пользователя
print ('Переменная пользователя:', some10)