# Задача-2: Запросите от пользователя число, сохраните в переменную,
# прибавьте к числу 2 и выведите результат на экран.
# Если возникла ошибка, прочитайте ее, вспомните урок и постарайтесь устранить ошибку.

# получение переменной пользователя
some0 = int(input('Введите число: '))

# вычисление требуемого результата
some0 += 2

# вывод результата на экран
print('Прибавляем 2 и получаем', some0)
